#### Часть 1
Шаг 1.Построим сеть с топологией согласно схеме:

![](/картинки/Pasted_image_20260413171136.png)

Шаг 2: В каждом роутере создаём Сообщение дня(MOTD) с  фио, номером группы и порядковым номером в журнале в формате:
"Работу выполнила(а) %фио% студент(ка) группы %группа%, в журнале под номером %число%"

![](/картинки/Pasted_image_20260413172114.png)

![](/картинки/Pasted_image_20260413172236.png)

![](/картинки/Pasted_image_20260413172341.png)

![](/картинки/Pasted_image_20260413172538.png)

Шаг 3: Переименовываем все устройства по шаблону сокращенное название страны-сокращенное название города-роль устройства сокращенно+порядковый номер. 
Например: rus-msk-pc1.

![](/картинки/Pasted_image_20260413173302.png)

![](/картинки/Pasted_image_20260413173425.png)

![](/картинки/Pasted_image_20260413173548.png)

![](/картинки/Pasted_image_20260413173629.png)

![](/картинки/Pasted_image_20260413173841.png)

![](/картинки/Pasted_image_20260413173906.png)

![](/картинки/Pasted_image_20260413173935.png)

![](/картинки/Pasted_image_20260413174133.png)

![](/картинки/Pasted_image_20260413174405.png)

![](/картинки/Pasted_image_20260413174436.png)

![](/картинки/Pasted_image_20260413174458.png)

![](/картинки/Pasted_image_20260413174812.png)

![](/картинки/Pasted_image_20260413174856.png)

![](/картинки/Pasted_image_20260413174927.png)

![](/картинки/Pasted_image_20260413175024.png)

![](/картинки/Pasted_image_20260413175039.png)

Шаг 4: Раздаём доменные имена согласно местоположению.
Настраиваем на всех роутерах и коммутаторах.
Для всех устройств в Новосибирске:

![](/картинки/Pasted_image_20260413180208.png)

![](/картинки/Pasted_image_20260413180258.png)

![](/картинки/Pasted_image_20260413180357.png)

Для всех устройств в Москве:

![](/картинки/Pasted_image_20260413181552.png)

![](/картинки/Pasted_image_20260413181648.png)

![](/картинки/Pasted_image_20260413181727.png)

![](/картинки/Pasted_image_20260413181806.png)

Шаг 5. Создание VLAN на SW0 и SW1

![](/картинки/Pasted_image_20260413182840.png)

![](/картинки/Pasted_image_20260413182902.png)

Шаг 6. Назначение портов VLAN на SW0 и SW1

![](/картинки/Pasted_image_20260413183319.png)

![](/картинки/Pasted_image_20260413183258.png)

Шаг 7: Создаём канал EtherChannel 2-го уровня между коммутаторами в Новосибирске, используя интерфейсы G0/1 и GO/2, со следующими требованиями:
-Используем стандартный протокол для создания логической связи под номером 1
-Коммутатор 0 является ответственным за инициирование согласования канала EtherChannel.
-Изменяем интерфейс агрегированного канала на транковый на обоих коммутаторах.
**Настройка на rus-nsk-sw0:**

![](/картинки/Pasted_image_20260413184834.png)

**Настройка на rus-nsk-sw1:**

![](/картинки/Pasted_image_20260413184935.png)

Шаг 8. Management Interface на SW0

![](/картинки/Pasted_image_20260414003432.png)

Шаг 9. Management Interface на SW1

![](/картинки/Pasted_image_20260414003614.png)

Шаг 10. Включение SSHv2 на SW0 и SW1
Создаем пользователя и включаем SSH:

![](/картинки/Pasted_image_20260414003934.png)

![](/картинки/Pasted_image_20260414004006.png)

Настраиваем виртуальные линии (vty) для удаленного доступа:

![](/картинки/Pasted_image_20260414004224.png)

![](/картинки/Pasted_image_20260414004241.png)

Шаг 11. Настройка транка на SW0 до R1

![](/картинки/Pasted_image_20260414004541.png)

Шаг 12. Настройка MOTD на SW0 и SW1

![](/картинки/Pasted_image_20260414004850.png)

![](/картинки/Pasted_image_20260414004920.png)

Шаг 13. Настройка безопасности портов f0/2, f0/3, f0/4 на SW0 и SW1
SW0

![](/картинки/Pasted_image_20260414005608.png)

![](/картинки/Pasted_image_20260414005709.png)

![](/картинки/Pasted_image_20260414005806.png)

SW1

![](/картинки/Pasted_image_20260414010011.png)

![](/картинки/Pasted_image_20260414010107.png)

![](/картинки/Pasted_image_20260414010158.png)

Проверка после настройки
SW0

![](/картинки/Pasted_image_20260414010509.png)

SW1

![](/картинки/Pasted_image_20260414184458.png)

Шаг 14. Защита консольного подключения

![](/картинки/Pasted_image_20260414185133.png)

![](/картинки/Pasted_image_20260414185154.png)

Шаг 15. Отключение таймаута для консоли и SSH

![](/картинки/Pasted_image_20260414185814.png)

![](/картинки/Pasted_image_20260414185833.png)

Шаг 16. Предотвращение прерывания консоли логами

![](/картинки/Pasted_image_20260414190505.png)

![](/картинки/Pasted_image_20260414190511.png)

Шаг 17. Изменение буфера истории команд

![](/картинки/Pasted_image_20260414190613.png)

![](/картинки/Pasted_image_20260414190633.png)

Часть 1 позади.  Сохраняем конфигурацию на SW0 и SW1 командой 
copy running-config startup-config
### Часть 2: Настройка маршрутизатора R1

 Шаг 1. Настройка интерфейса f0/1

 ![](/картинки/Pasted_image_20260414191002.png)

Шаг 2. Настройка маршрутизации между VLAN
1. Включим физический интерфейс, который смотрит в сторону SW0:

![](/картинки/Pasted_image_20260414191117.png)

2. Создадим сабинтерфейсы для каждого VLAN. Тег должен совпадать с номером VLAN.

![](/картинки/Pasted_image_20260414191330.png)

Шаг 3. Настройка DHCP-сервера на R1
Для каждого VLAN создаем пул адресов

![](/картинки/Pasted_image_20260414191842.png)

Исключаем адреса, которые не должны выдаваться

![](/картинки/Pasted_image_20260414191907.png)

Проверка, что у PC0/1/2/3/4/5 выданы правильные айпи-адреса

![](/картинки/Pasted_image_20260415144744.png)

![](/картинки/Pasted_image_20260415144733.png)

![](/картинки/Pasted_image_20260415144827.png)

![](/картинки/Pasted_image_20260415144838.png)

![](/картинки/Pasted_image_20260415144847.png)

![](/картинки/Pasted_image_20260415144858.png)

Шаг 4. Проверка пинга
У меня 3.0.0.100, адрес 3.0.0.101 тоже доступен, так как DHCP работает корректно.

![](/картинки/Pasted_image_20260415152057.png)

![](/картинки/Pasted_image_20260415152108.png)

# Часть 3

Шаг 1. Настройка имени хоста

![](/картинки/Pasted_image_20260415154039.png)

Шаг 2. Включение маршрутизации

![](/картинки/Pasted_image_20260415154115.png)

Шаг 3. Создание VLAN 100 и 200 с именами

![](/картинки/Pasted_image_20260415154145.png)

Проверка:

![](/картинки/Pasted_image_20260415154245.png)

Шаг 4. Назначение портов доступа в VLAN

![](/картинки/Pasted_image_20260415154431.png)

Проверка:

![](/картинки/Pasted_image_20260415154517.png)

Шаг 5. Создание SVI для VLAN 100 и 200

![](/картинки/Pasted_image_20260415154837.png)

Проверка:

![](/картинки/Pasted_image_20260415155007.png)

Шаг 6. Настройка интерфейсов 3-го уровня

![](/картинки/Pasted_image_20260415155201.png)

Проверка:

![](/картинки/Pasted_image_20260415155313.png)

Шаг 7. Настройка PC6 и проверка пинга

![](/картинки/Pasted_image_20260415155658.png)

 Ответ от шлюза:

![](/картинки/Pasted_image_20260415155719.png)

Также заодно настроили PC7

![](/картинки/Pasted_image_20260415155952.png)

Проверка:

![](/картинки/Pasted_image_20260415161235.png)

# Часть 4
Шаг 1. Настройка IP-адресов на R2

![](/картинки/Pasted_image_20260415164455.png)

Проверка:

![](/картинки/Pasted_image_20260415164531.png)

Шаг 2. Настройка IP-адресов на R3

![](/картинки/Pasted_image_20260415164615.png)

Проверка:

![](/картинки/Pasted_image_20260415164633.png)

Шаг 3: Настройка HSRP на R2 и R3:

![](/картинки/Pasted_image_20260415165036.png)

![](/картинки/Pasted_image_20260415165054.png)

Проверка HSRP:

![](/картинки/Pasted_image_20260415165133.png)

![](/картинки/Pasted_image_20260415165310.png)

Проверка связности между R2 и R3:

![](/картинки/Pasted_image_20260415165446.png)

![](/картинки/Pasted_image_20260415165530.png)

Проверка связности с MLS:

![](/картинки/Pasted_image_20260415165619.png)

Настройка Server0(на всякий случай):

![](/картинки/Pasted_image_20260415165740.png)

Сервер использует виртуальный шлюз 10.0.0.1. Если R2 упадёт, R3 автоматически подхватит этот айпи, и сервер не заметит сбоя.
Проверка связности с сервера:

![](/картинки/Pasted_image_20260415170000.png)

# Часть 5
Шаг 1: Настройка EIGRP на R1
![](/картинки/Pasted_image_20260415171104.png)
